In [1]:
import pandas as pd
from connection import dbsession
from models import Customers

customers=pd.read_csv("Customers.csv")

In [2]:
customers

,id,fname,lname,mobile,email,password,ncode,address
0,1,kiana,kiazad,9129423212,kianakiazad@gmail.com,12345,NaN,"yazd,razmandegan"
1,2,kamyar,kia,9137625890,kamyarkia@gmail.com,65241,NaN,"yazd,kh kashani"
2,3,ali,dehghan,9132532781,alidehghan@gmail.com,87162,NaN,"yazd,meydane alem"
3,4,reza,zare,9142561341,rezazare@gmail.com,89182,NaN,"yazd,shahidane ashraf"
4,5,hasan,jafari,9131514235,hasanjafari@gmail.com,98172,NaN,"yazd,kh ferdosi"

In [3]:
dbsession.bulk_insert_mappings(Customers, customers.to_dict(orient="records"))
dbsession.commit()

In [4]:
import pandas as pd
from connection import dbsession
from models import Categories

categories=pd.read_csv("Categories (2).csv")

In [5]:
categories

   id          name
0   1  Smart Phones
1   2      Chargers
2   3   Accessories

In [6]:
dbsession.bulk_insert_mappings(Categories, categories.to_dict(orient="records"))
dbsession.commit()

In [7]:
import pandas as pd
from connection import dbsession
from models import Products

products=pd.read_csv("Products 2.csv")

In [8]:
products

   id  cat_id              name          price
0   1       1         Iphone 13   50,000,000
1   2       1         Iphone 12   40,000,000
2   3       1       Samsung A20   20,000,000
3   4       1       Samsung A15   15,000,000
4   5       2   Iphone Chargers    1,000,000
5   6       2  Samsung Chargers    3,000,000
6   7       3             Glass      200,000
7   8       3              Case      150,000

In [9]:
products["price"] = products.apply(lambda row: float(row["price"].replace(",","")),axis=1)

In [10]:
products.dtypes

id          int64
cat_id      int64
name       object
price     float64
dtype: object

In [11]:
dbsession.bulk_insert_mappings(Products, products.to_dict(orient="records"))
dbsession.commit()

In [12]:
import pandas as pd
from connection import dbsession
from models import Invoices

invoices=pd.read_csv("Invoices.csv")

In [13]:
invoices

   id  customer_id
0   1            2
1   2            2
2   3            1
3   4            1
4   5            3
5   6            4
6   7            4

In [14]:
dbsession.bulk_insert_mappings(Invoices, invoices.to_dict(orient="records"))
dbsession.commit()

In [15]:
import pandas as pd
from connection import dbsession
from models import InvoiceProduct

invoiceProduct=pd.read_csv("InvoiceProduct.csv")

In [16]:
invoiceProduct

   id  invoice_id  product_id
0   1           1           2
1   2           1           2
2   3           3           4
3   4           2           1
4   5           2           1
5   6           5           2

In [17]:
dbsession.bulk_insert_mappings(InvoiceProduct, invoiceProduct.to_dict(orient="records"))
dbsession.commit()